apache/nuttx/arch/arm/src/kinetis/chip/kinetis_k66fmc.h
/* Flash Bank 2-3 Control Register */

#define FMC_PFB23CR_RFU                 (1 << 0)  /* Bit 0:  served for future use */
#define FMC_PFB23CR_B1IPE               (1 << 1)  /* Bit 1:  Bank 1 Instruction Prefetch Enable */
#define FMC_PFB23CR_B1DPE               (1 << 2)  /* Bit 2:  Bank 1 Data Prefetch Enable */
#define FMC_PFB23CR_B1ICE               (1 << 3)  /* Bit 3:  Bank 1 Instruction Cache Enable */
#define FMC_PFB23CR_B1DCE               (1 << 4)  /* Bit 4:  Bank 1 Data Cache Enable */
                                                  /* Bits 5-16: Reserved */
#define FMC_PFB23CR_B1MW_SHIFT          (17)      /* Bits 17-18: Bank 1 Memory Width */
#define FMC_PFB23CR_B1MW_MASK           (3 << FMC_PFB23CR_B1MW_SHIFT)
#  define FMC_PFB23CR_B1MW_32BITS       (0 << FMC_PFB23CR_B1MW_SHIFT) /* 32 bits */
#  define FMC_PFB23CR_B1MW_64BITS       (1 << FMC_PFB23CR_B1MW_SHIFT) /* 64 bits */
#  define FMC_PFB23CR_B1MW_128BITS      (2 << FMC_PFB23CR_B1MW_SHIFT) /* 128 bits */
                                                  /* Bits 19-27: Reserved */
#define FMC_PFB23CR_B1RWSC_SHIFT        (28)      /* Bits 28-31: Bank 1 Read Wait State Control */
#define FMC_PFB23CR_B1RWSC_MASK         (15 << FMC_PFB23CR_B0RWSC_SHIFT)

/* Cache Directory Storage for way=w and set=s, w=0..3, s=0..7 */

#define FMC_TAGVD_VALID                 (1 << 0)  /* Bit 0:  1-bit valid for cache entry */
                                                  /* Bits 1-5: Reserved */
#define FMC_TAGVD_TAG_SHIFT             (6)       /* Bits 6-21: 16-bit tag for cache entry */
#define FMC_TAGVD_TAG_MASK              (0xffff << FMC_TAGVD_TAG_SHIFT)
                                                  /* Bits 19-31: Reserved */

/* Cache Data Storage (UpperMost, MidUpper, MidLower LowerMost) for way=w and set=s,
 * w=0..3, s=0..7  128-bit data in four 32-bit registers.
 */

/************************************************************************************
 * Public Types
 ************************************************************************************/

/************************************************************************************
 * Public Data
 ************************************************************************************/

/************************************************************************************
 * Public Functions
 ************************************************************************************/

#endif /* __ARCH_ARM_SRC_KINETIS_CHIP_KINETIS_K66FMC_H */
